jmeter/report/statistics.json
{
  "POST-报名" : {
    "transaction" : "POST-报名",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 4.47,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 49.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 48.949999999999974,
    "throughput" : 5.1096009401665725,
    "receivedKBytesPerSec" : 1.0179283122988094,
    "sentKBytesPerSec" : 1.3771971284042714
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 500,
    "errorCount" : 100,
    "errorPct" : 20.0,
    "meanResTime" : 3.570000000000002,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 149.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 16.0,
    "throughput" : 25.349827621172174,
    "receivedKBytesPerSec" : 9.149703407016831,
    "sentKBytesPerSec" : 5.144232597343338
  },
  "GET-报名人数" : {
    "transaction" : "GET-报名人数",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.1399999999999983,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 3.9000000000000057,
    "pct2ResTime" : 4.949999999999989,
    "pct3ResTime" : 6.0,
    "throughput" : 5.122688386865427,
    "receivedKBytesPerSec" : 1.100577583115619,
    "sentKBytesPerSec" : 1.100577583115619
  },
  "GET-活动列表" : {
    "transaction" : "GET-活动列表",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.6349999999999993,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 40.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 15.940000000000055,
    "throughput" : 21.146119687037427,
    "receivedKBytesPerSec" : 11.089322531190525,
    "sentKBytesPerSec" : 3.3247317086064707
  },
  "POST-登录" : {
    "transaction" : "POST-登录",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.9700000000000015,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 149.0,
    "pct1ResTime" : 6.900000000000006,
    "pct2ResTime" : 8.949999999999989,
    "pct3ResTime" : 147.6199999999993,
    "throughput" : 5.070993914807302,
    "receivedKBytesPerSec" : 1.7332498732251522,
    "sentKBytesPerSec" : 1.0944234913793105
  }
}