jmeter/runs/20260428_163618/report/statistics.json
{
  "POST-报名" : {
    "transaction" : "POST-报名",
    "sampleCount" : 300,
    "errorCount" : 300,
    "errorPct" : 100.0,
    "meanResTime" : 2.9933333333333327,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 8.990000000000009,
    "throughput" : 10.104071940992219,
    "receivedKBytesPerSec" : 2.1297160229530836,
    "sentKBytesPerSec" : 2.7628321713650603
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1350,
    "errorCount" : 300,
    "errorPct" : 22.222221,
    "meanResTime" : 2.116296296296296,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 7.490000000000009,
    "throughput" : 45.43771667059338,
    "receivedKBytesPerSec" : 15.340981402090136,
    "sentKBytesPerSec" : 9.752148825350881
  },
  "GET-报名人数" : {
    "transaction" : "GET-报名人数",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5266666666666675,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 10.105433354667026,
    "receivedKBytesPerSec" : 2.1754971662680633,
    "sentKBytesPerSec" : 2.1710891972917437
  },
  "GET-活动列表" : {
    "transaction" : "GET-活动列表",
    "sampleCount" : 450,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.406666666666667,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 6.470000000000027,
    "throughput" : 31.11602821186558,
    "receivedKBytesPerSec" : 16.34806950974969,
    "sentKBytesPerSec" : 4.892266154404647
  },
  "POST-登录" : {
    "transaction" : "POST-登录",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.8933333333333344,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 15.900000000000091,
    "throughput" : 10.09862995253644,
    "receivedKBytesPerSec" : 3.081857285319958,
    "sentKBytesPerSec" : 2.440830969973407
  }
}